app/Controllers/DonasiController.php

SELECT *
FROM `donasi_uang`
---
    public function donasiuang()
    {
        $data['donasi_uang'] = $this->modelDonasiUang->findAll();

SELECT *
FROM `donasi_barang`
---
    public function donasibarang()
    {
        $data['donasi_barang'] = $this->modelDonasiBarang->findAll();