app/Controllers/KwitansiController.php

    public function cetakKwitansiBarang($id)
    {
        // Load data donasi barang berdasarkan ID
        $barangModel = new ModelDonasiBarang();
        $data['donasi'] = $barangModel->find($id);
---
SELECT *
FROM `donasi_barang`
WHERE `donasi_barang`.`id` = '10'

    public function cetakKwitansiUang($id)
    {
        // Load data donasi uang berdasarkan ID
        $uangModel = new ModelDonasiUang();
        $data['donasi'] = $uangModel->find($id);
---
SELECT *
FROM `donasi_uang`
WHERE `donasi_uang`.`id` = '4'